
## Plan Result (prod)

[CI link](https://github.com/goda6565/lambda-bot/actions/runs/15224130362)


<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.api_gateway.aws_apigatewayv2_integration.lambda_integration
  * module.api_gateway.aws_apigatewayv2_route.lambda_function_route
  * module.api_gateway.aws_lambda_permission.allow_apigateway
  * module.lambda.aws_lambda_alias.lambda
  * module.lambda.aws_lambda_function.lambda


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api_gateway.aws_apigatewayv2_integration.lambda_integration will be created
  + resource "aws_apigatewayv2_integration" "lambda_integration" {
      + api_id                                    = "0pdgg6nqu1"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = 30000
    }

  # module.api_gateway.aws_apigatewayv2_route.lambda_function_route will be created
  + resource "aws_apigatewayv2_route" "lambda_function_route" {
      + api_id             = "0pdgg6nqu1"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /invoke"
      + target             = (known after apply)
    }

  # module.api_gateway.aws_lambda_permission.allow_apigateway will be created
  + resource "aws_lambda_permission" "allow_apigateway" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "lambda-bot-prod"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + qualifier           = "prod"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:061051222129:0pdgg6nqu1/*/*"
      + statement_id        = "AllowInvokeFromApiGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.lambda.aws_lambda_alias.lambda will be created
  + resource "aws_lambda_alias" "lambda" {
      + arn              = (known after apply)
      + function_name    = "lambda-bot-prod"
      + function_version = (known after apply)
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "prod"
    }

  # module.lambda.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "lambda-bot-prod"
      + id                             = (known after apply)
      + image_uri                      = "public.ecr.aws/lambda/provided:al2"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::061051222129:role/lambda-bot-prod-role"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "lambda-bot-prod"
        }
      + tags_all                       = {
          + "Name" = "lambda-bot-prod"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ENV" = "prod"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label prod/add-or-update: POST https://api.github.com/repos/goda6565/lambda-bot/issues/3/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]
<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":3,"Program":"tfcmt","SHA1":"0ee6b0a9d9f23e68d797cdcd55851117c8ad8b0a","Target":"prod","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->